export const questions = [
    {
      question: "Что такое первый закон Ньютона? Опишите его.",
      options: [
        {
          text: "Закон инерции: тело остается в покое или движется равномерно по прямой, если на него не действует внешняя сила.",
          isCorrect: true
        },
        {
          text: "Закон действия и противодействия: с каждым действием есть равное и противоположно направленное противодействие.",
          isCorrect: false
        },
        {
          text: "Закон изменения импульса: изменение импульса тела равно интегралу приложенной к нему силы по времени.",
          isCorrect: false
        }
      ]
    },
    {
      question: "Какая формула используется для вычисления кинетической энергии тела?",
      options: [
        {
          text: "E_k = 1/2mv^2",
          isCorrect: true
        },
        {
          text: "E_k = mgh",
          isCorrect: false
        },
        {
          text: "E_k = Fd",
          isCorrect: false
        }
      ]
    },
    {
      question: "Как изменяется скорость тела, если на него действует постоянная сила?",
      options: [
        {
          text: "Скорость увеличивается линейно со временем.",
          isCorrect: false
        },
        {
          text: "Скорость остается постоянной.",
          isCorrect: false
        },
        {
          text: "Скорость увеличивается пропорционально квадрату времени.",
          isCorrect: true
        }
      ]
    },
    {
      question: "Что такое закон всемирного тяготения Ньютона? Как вы можете его объяснить?",
      options: [
        {
          text: "Сила гравитации между двумя телами пропорциональна произведению их масс и обратно пропорциональна квадрату расстояния между ними.",
          isCorrect: true
        },
        {
          text: "Сила гравитации между двумя телами прямо пропорциональна их массам.",
          isCorrect: false
        },
        {
          text: "Сила гравитации между двумя телами обратно пропорциональна их массам.",
          isCorrect: false
        }
      ]
    },
    {
      question: "Что такое закон сохранения энергии? Дайте примеры.",
      options: [
        {
          text: "Сумма кинетической и потенциальной энергии остается постоянной в замкнутой системе.",
          isCorrect: true
        },
        {
          text: "Энергия не может быть создана или уничтожена, только преобразована из одной формы в другую.",
          isCorrect: false
        },
        {
          text: "Энергия системы равна массе системы, умноженной на скорость света в квадрате.",
          isCorrect: false
        }
      ]
    },
    {
      question: "Как изменится скорость свободного падения на поверхности Луны по сравнению с Землей?",
      options: [
        {
          text: "Увеличится.",
          isCorrect: false
        },
        {
          text: "Уменьшится.",
          isCorrect: false
        },
        {
          text: "Останется такой же.",
          isCorrect: true
        }
      ]
    },
    {
      question: "Что такое электромагнитное поле? Какие у вас есть примеры его проявления в повседневной жизни?",
      options: [
        {
          text: "Пространство, в котором взаимодействуют электрические и магнитные поля.",
          isCorrect: true
        },
        {
          text: "Пространство, в котором протекает электрический ток.",
          isCorrect: false
        },
        {
          text: "Пространство, в котором находятся электрические заряды.",
          isCorrect: false
        }
      ]
    },
    {
      question: "Как определить мощность электрической цепи? Напишите формулу.",
      options: [
        {
          text: "P = V * I",
          isCorrect: true
        },
        {
          text: "P = I / V",
          isCorrect: false
        },
        {
          text: "P = V / I",
          isCorrect: false
        }
      ]
    },
    {
      question: "Что такое закон Ома? Какова его формула?",
      options: [
        {
          text: "Закон, утверждающий, что сила тока через проводник прямо пропорциональна напряжению между его концами.",
          isCorrect: true
        },
        {
          text: "V = IR",
          isCorrect: false
        },
        {
          text: "V = I / R",
          isCorrect: false
        }
      ]
    },
    {
      question: "Что такое электромагнитная индукция? Как она связана с законом Фарадея?",
      options: [
        {
          text: "Электромагнитная индукция - это процесс создания электрического тока в проводнике под воздействием изменяющегося магнитного поля.",
          isCorrect: true
        },
        {
          text: "Закон Фарадея утверждает, что индуцированная в проводнике ЭДС пропорциональна скорости изменения магнитного потока через поверхность, ограниченную проводником.",
          isCorrect: true
        },
        {
          text: "Оба утверждения верны.",
          isCorrect: false
        }
      ]
    }
  ]